Repository: AIndoria/sg
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: ar_sa, el_gr, et_ee

source: No NFO Found!
ar_sa: لم يتم العثور على معلومات الإصدار (NFO)!
el_gr: Δεν βρέθηκε NFO!
et_ee: NFO't ei leitud!

source: Copy Links
ar_sa: انسخ الروابط
el_gr: Αντιγραφή Συνδέσμων
et_ee: Kopeeri linke

source: Magnet
ar_sa: رابط Magnet

source: Torrent
ar_sa: تورنت

source: Loading...
ar_sa: جار التحميل...
el_gr: Φορτώνει...
et_ee: Laadimine...

source: Uploading...
ar_sa: جار الرفع.
el_gr: Ανεβάζει...
et_ee: Üleslaadimine...

source: Permalink
ar_sa: الرابط الثابت
el_gr: Σύνδεσμος αυτής της σελίδας
et_ee: Püsilink

source: Direct Links
ar_sa: روابط مباشرة
el_gr: ΑΜΕΣΟΙ ΣΥΝΔΕΣΜΟΙ
et_ee: Otselink

source: Go to Steam
ar_sa: اذهب إلى ستيم (Steam)
el_gr: Πήγαινε στο Steam
et_ee: Mine Steam'i

source: Go to Site
ar_sa: اذهب إلى الموقع
el_gr: Πήγαινε στη Σελίδα
et_ee: Mine saidile

source: FAQ
ar_sa: الأسئلة الأكثر شيوعاً (FAQ)
el_gr: ΕΡ&ΑΠ
et_ee: KKK

source: Why make another "scene games" site when there are countless others?
ar_sa: لماذا هذا الموقع بما ان هناك عدد لا يحصى من المواقع الاخرى؟
el_gr: Γιατί να φτιάξεις μία ακόμα σελίδα για "scene παιχνίδια" όταν υπάρχουν αμέτρητες άλλες;
et_ee: Miks teha uus "scene mängude" leht, kui on olemas palju teisi?

source: All the other sites are littered with ads and pop-ups. They are also slow at uploading and profit from scene releases!
ar_sa: جميع المواقع الأخرى مليئة بالإعلانات اللتي تظهر ظهور مفاجئ. وهذه المواقع أيضا تكسب ربح من الإصدارات وهم بطيئين برفع الروابط!
el_gr: Όλες οι άλλες σελίδες είναι πνιγμένες στις διαφημίσεις και pop-ups. Επίσης καθυστερούν στο ανέβασμα και βγάζουν κέρδος απο τα releases της scene!
et_ee: Kõik teised on reostatud reklaamide ja hüpikakendega. Need on ka aeglased üleslaadimisel ja teenivad raha scene'i väljaannetelt!

source: There is an incorrect game associated with a release. Why does this happen?
ar_sa: يوجد لعبة غير الموجودة باسم الإصدار, لماذا يحدث ذلك؟
el_gr: Υπάρχει ένα λάθος παιχνίδι συνδυασμένο με ένα release. Γιατί συμβαίνει αυτο;
et_ee: Siin on üks mäng seostatud vale väljaandega. Miks see juhtub?

source: Sometimes a release gets matched with the wrong game. We usually notice this and fix it.
ar_sa: أحيانا يطابق الإصدار لعبة أخرى بالخطأ. بالعادة نحن نلاحظ ذلك ونصلحه.
el_gr: Κάποιες φορές ένα release συνδυάζεται με το λάθος παιχνίδι. Συνήθως το αντιλαμβανόμαστε και το φτιάχνουμε.
et_ee: Mõnikord mõni väljaanne pannakse paari vale mänguga. Me tavaliselt näeme seda ja parandame selle.

source: What torrent client should I use?
ar_sa: ما هو برنامج التورنت اللذي على استخدامه؟
el_gr: Τι torrent client να χρησιμοποιήσω;
et_ee: Mis torrenti klienti võiksin ma kasutada?

source: Torrent users should be using %deluge% or %qbittorent% (anything besides μTorrent please!).
ar_sa: %deluge% او %qbittorent% عليك استخدام μTorrent استخدم أي شيء الا
el_gr: Οι χρήστες torrent προτείνεται να χρησιμοποιούν %deluge% ή %qbittorent% (οτιδήποτε εκτός απο μΤorrent σας παρακαλώ!).
et_ee: Torrenti kasutajad peaksid kasutama %deluge%'t või %qbittorent% (ükskõik mida peale μTorrent palun!).

source: What if the direct links go down or there are no seeders for the release I want?
ar_sa: ماذا اذا الروابط المباشرة لا تعمل او التورنت لا يعمل للإصدار اللذي اريده؟
el_gr: Τι γίνεται αν οι άμεσοι σύνδεσμοι είναι εκτός σύνδεσης και δεν υπάρχουν διαμοιραστές (seeders) για το release που θέλω;
et_ee: Mis siis, kui otselingid enam ei toimi või pole seemned sellele väljaandele mida tahan?

source: We will be implementing a way for releases to be re-uploaded in the future. We DO NOT re-seed torrents, so please consider seeding back what you leech (maybe get a seedbox and help out).
ar_sa: سوف نعمل على طريقة لإعادة رفع الإصدارات في المستقبل. نحن لا نعيد رفع التورنت. اذا رجائا حاول ان تستمر في رفع التورنت عندما تنتهي من تنزيله.
el_gr: Θα υλοποιήσουμε ένα τρόπο ώστε τα releases να επαν-ανεβάζονται στο μέλλον. ΔΕΝ επανα-διαμοιράζουμε (re-seed) τα torrent , οπότε παρακαλώ προσπαθήστε να διαμοιράσετε (seed) όσα κατεβάζετε (αγοράσετε ένα seedbox, ίσως, και βοηθήσετε).
et_ee: Me plaanime võtta kasutusele viisi väljaannete uuesti üleslaadimiseks tulevikus. Me ei seed'i torrenteid uuesti, nii et palun seed'i tagasi mida sa laed. (võibolla osta seemnekast ja aita)

source: How do I mount an ISO and install the game I downloaded and how do I crack it?!
ar_sa: كيف يمكنني تشغيل ملف اسطوانة في الدرايف الوهمي (ايزو) وتنصيب اللعبة وعمل كراك لها؟!
el_gr: Πώς κάνω mount ένα ISO και εγκαταστώ το παιχνίδι που κατέβασα και πώς το σπάω;!
et_ee: Kuidas ma avan ISO ja installin mängu mille ma tõmbasin ning kuidas crackin?!

source: You must be a virgin at this ;) There are countless tutorials if you do a Google search. Basically, if you know how to copy and paste things you're already a pro.
ar_sa: يوجد هناك دروس كثيرة كيف تعمل ذلك اذا بحثت على جوجل. اذا كنت تعرف كيف تعمل لصق ونسخ اذا انت محترف ويجب ان تكون قادر على ذلك.
el_gr: Πρέπει να είσαι παρθένος σε αυτα ;) Υπάρχουν αμέτρητα tutorials αν κάνεις μια αναζήτηση στη Google. Βασικά, αν ξερεις πως να κάνεις αντιγραφή και επικόλληση κάποια πράγματα, είσαι ήδη ξεφτέρι.
et_ee: Sa oled selles vist uus ;) Leiad palju õpetusi kui teed Google'i otsingu. Põhimõtteliselt, kui sa oskad kopeerida ja kleepida asju oled sa juba pro.

source: Help the game I downloaded doesn't work!
ar_sa: الرجاء المساعدة. اللعبة اللتي حملتها لا تعمل!
el_gr: Βοήθεια, το παιχνίδι που κατέβασα δεν λειτουργεί!
et_ee: Aita, mäng mille tõmbasin ei tööta!

source: First, please be sure you are cracking the game after you install it (and that your anti-virus isn't deleting the crack!). Second, some releases may not work as the scene does make mistakes. If so, a "PROPER" release will be usually be posted.
ar_sa: أولا.. تأكد بانك نسخت الكراك بعد التنصيب (وان مكافح الفايروس خاصتك لا يحذف الكراك!). ثانيا. أحيانا بعض الإصدارات يمكن ان تكون لا تعمل في حالات نادرة لان الإصدار يمكن ان يكون فيه خطأ. في هذه الحالة, اصدار مناسب "بروبر" سوف يتم رفعه.
el_gr: Πρώτα, παρακαλώ βεβαιώσου ότι "έσπασες" το παιχνίδι αφού το κατέβασες (και ότι το anti-virus σου δεν σβήνει το crack!). Δεύτερον, κάποια releases ίσως να μην δουλεύουν καθώς η scene κάνει και λάθη. Σε τέτοιες περιπτώσεις, ένα "PROPER" release συνήθως ποστάρεται.
et_ee: Kõigepealt, tee kindlaks et sa crackisid mängu pärast installimist (ning et su antiviirus ei kustuta cracki). Teiseks, mõned väljaanded ei pruugi toimida, sest scene teeb ka vigu. Kui on nii, siis tavaliselt postitatakse "PROPER" release, mis peaks toimima.

source: I love this site! How can I donate?
ar_sa: انا احب هذا الموقع! كيف يمكنني التبرع؟
el_gr: Λατρεύω αυτή τη σελίδα! Πώς μπορώ να κάνω δωρεά;
et_ee: Ma armastan seda saiti! Kuidas saan ma annetada?

source: We're not going to profit off of scene releases. You can donate to us by seeding the torrents you download or by telling others about this site (on forums, Reddit, your friends, etc).
ar_sa: نحن لا نجني ربح من الإصدارات. اذا كنت تريد المساعدة, استمر برفع التورينت بعد الانتهاء من التنزيل او اخبر الناس الاخرون عن هذا الموقع (على المنتديات او ريديت او اصدقائك او الخ).
el_gr: Δεν πρόκειται να βγάλουμε κέρδος από scene releases. Μπορείτε να μας κάνετε δωρεά κάνοντας διαμοιρασμό (seeding) στα torrent που κατεβάζετε ή με το να λέτε σε άλλους για αυτή τη σελίδα (σε φόρουμ, στο Reddit, σε φίλους κλπ.)
et_ee: Me ei hakka raha teenima scene väljaannete pealt. Sa saad annetada meile, kui seedid torrenteid või räägid teistele selle lehe kohta (foorumites, Redditis, sõpradele, jne).

source: Edit Game
ar_sa: تحرير اللعبة
el_gr: Επεξεργασία Παιχνιδιού
et_ee: Muuda mängu

source: NFO
ar_sa: معلومات الإصدار NFO

source: Genres
ar_sa: الانواع
el_gr: Είδη
et_ee: Žanrid

source: Staff Picks
ar_sa: تم اختياره من الموقع
el_gr: Επιλογές Προσωπικού
et_ee: Personali Valikud

source: New Releases
ar_sa: إصدارات جديدة
el_gr: Νέα Releases
et_ee: Uued Väljaanded

source: Home
ar_sa: الصفحة الرئيسية
el_gr: Αρχική
et_ee: Kodu

source: Search
ar_sa: بحث
el_gr: Αναζήτηση
et_ee: Otsi

source: Explore
ar_sa: تصفح
el_gr: ΕΞΕΡΕΥΝΗΣΗ
et_ee: Avasta

source: All Games
ar_sa: جميع الالعاب
el_gr: Όλα τα παιχνίδια
et_ee: Kõik Mängud

source: P2P (Soon™?)
ar_sa: من جهاز الى اخر "P2P" (قريبا؟)
el_gr: P2P (Σύντομα™?)
et_ee: P2P (Varsti™?)

source: RSS Feeds
ar_sa: ملقم RSS
el_gr: RSS Τροφοδοσίες
et_ee: RSS Feedid

source: RSS Feed for Torrent clients
ar_sa: ملقم RSS لبرامج التورنت
el_gr: RSS Τροφοδοσία για torrent clients
et_ee: RSS Feed Torrenti klientidele

source: Torrents
ar_sa: تورنت Torrent
et_ee: Torrentid

source: Login
ar_sa: تسجيل الدخول
el_gr: ΕΙΣΟΔΟΣ
et_ee: Logi sisse

source: Admin
ar_sa: المدير
el_gr: Διαχειριστής

source: Logout
ar_sa: تسجيل الخروج
el_gr: ΕΞΟΔΟΣ
et_ee: Logi välja

source: Change Language
ar_sa: تغيير اللغة
el_gr: Αλλαγή Γλώσσας
et_ee: Muuda Keelt

source: English
ar_sa: انجليزي
el_gr: Αγγλικά
et_ee: Inglise

source: German
ar_sa: الماني
el_gr: Γερμανικά
et_ee: Saksa

source: Russian
ar_sa: روسي
el_gr: Ρώσικα
et_ee: Vene

source: Spanish
ar_sa: اسباني
el_gr: Ισπανικά
et_ee: Hispaania

source: Hodor
ar_sa: هودور هودور

source: Browse
ar_sa: تصفح
el_gr: Ξεφύλλισε
et_ee: Sirvi

source: Access Denied
ar_sa: الدخول مرفوض
el_gr: Απαγορεύεται η Πρόσβαση
et_ee: Ligipääs Keelatud

source: You cannot view this page.
ar_sa: لا يمكنك رؤية هذه الصفحة.
el_gr: Δεν μπορείς να δεις αυτή τη σελίδα.
et_ee: Sa ei saa seda lehte kuvada.

source: Username
ar_sa: اسم المستخدم
el_gr: Όνομα Χρήστη
et_ee: Kasutajanimi

source: Password
ar_sa: كلوة المرور
el_gr: Κωδικός
et_ee: Parool

source: Registration Code
ar_sa: رقم التسجيل
el_gr: Κωδικός Εγγραφής
et_ee: Registreerimiskood

source: Register
ar_sa: التسجيل
el_gr: Εγγραφή
et_ee: Registreeri

source: Copy Links to Clipboard
ar_sa: انسخ الروابط الى الحافظة
el_gr: Αντιγραφή Συνδέσμων στο Πρόχειρο
et_ee: Kopeeri lingid lõikepuhvrisse

source: Open all Links (Allow Popups)
ar_sa: افتح جميع الروابط (اسمح بال pop ups)
el_gr: Άνοιγμα όλων των Συνδέσμων (Επέτρεψε Αναδυόμενα)
et_ee: Ava kõik lingid (Luba Hüpikaknad)

source: Releases by %group%
ar_sa: إصدارات من %group%
el_gr: Releases από %group%
et_ee: Väljaanded %group%'i poolt

source: Search Results
ar_sa: نتائج البحث
el_gr: Αποτελέσματα Αναζήτησης
et_ee: Otsingu tulemused

source: %totalresults% games found for "%term%"
ar_sa: %totalresults% العاب وجدت ل "%term%"
el_gr: %totalresults% παιχνίδια βρέθηκαν για "%term%"
et_ee: %totalresults% mängu leitud otsingusõnaga "%term%"

source: Relevance
ar_sa: ذات صلة
el_gr: Σχετικότητα
et_ee: Relevantsus

source: Title
ar_sa: العنوان
el_gr: Τίτλος
et_ee: Tiitel

source: Date
ar_sa: التاريخ
el_gr: Ημερομηνία
et_ee: Kuupäev
